# Посчитать четные и нечетные цифры введенного натурального числа. Например, если введено число 34560, то у него 3 четные цифры (4, 6 и 0) и 2 нечетные (3 и 5).
# а = 12334
# взять переменную 
# Раздилить переменную на отдельние части 
# сравнить по очереди все части 
# Если число делиться на два тогда добавить в переменную вапр
# Если нет то в невапр
# Вивести на екран количество щетних и нет
list1 = [1,2,3,4,5]
counter1 = []
counter2 = []
for time in list1:
    if time / 2:
        counter1 = counter1 + time
    if time /! 2:
        counter2 + counter2 = time
print(counter1)
print(counter2)